{
    "title":  "AMR Stewardship",
    "title_pt":  "Gestão de AMR",
    "text":  "Antimicrobial resistance stewardship programs are mandatory to prevent the collapse of current therapeutic protocols. Not only has surveillance been expanded, but compliance auditing has also been intensified; therefore, reporting obligations have increased. Should breaches occur, sanctions would be imposed pursuant to the aforementioned guidelines. Formularies, antibiograms, and escalation pathways are codified to constrain empirical prescribing. Rarely do empirical regimens persist without stewardship review; hence, corrective training and audit feedback are scheduled.",
    "translation":  "Programas de gestão de resistência antimicrobiana são obrigatórios para evitar o colapso dos protocolos terapêuticos atuais. Não apenas a vigilância foi ampliada, como também a auditoria de conformidade foi intensificada; portanto, as obrigações de reporte aumentaram. Caso ocorram violações, sanções seriam impostas conforme as diretrizes supracitadas. Fórmularios terapêuticos, antibiogramas e vias de escalonamento são codificados para restringir prescrição empírica. Raramente regimes empíricos persistem sem revisão da governança de AMR; por isso, treinamento corretivo e feedback de auditoria são agendados.",
    "pairs":  [
                  { "pt": "Programas de gestão de AMR são obrigatórios.", "en": "AMR stewardship programs are mandatory." },
                  { "pt": "Não apenas vigilância foi ampliada; auditoria intensificada.", "en": "Not only has surveillance been expanded, but auditing intensified." },
                  { "pt": "Caso ocorram violações, sanções serão impostas.", "en": "Should breaches occur, sanctions would be imposed." },
                  { "pt": "Antibiogramas e formulários orientam prescrição.", "en": "Antibiograms and formularies guide prescribing." },
                  { "pt": "Vias de escalonamento são codificadas.", "en": "Escalation pathways are codified." },
                  { "pt": "Raramente regimes empíricos persistem sem revisão.", "en": "Rarely do empirical regimens persist without review." },
                  { "pt": "Treinamento corretivo é agendado.", "en": "Corrective training is scheduled." },
                  { "pt": "Feedback de auditoria melhora conformidade.", "en": "Audit feedback improves compliance." },
                  { "pt": "Obrigações de reporte aumentaram sob diretrizes.", "en": "Reporting obligations have increased under guidelines." },
                  { "pt": "Governança impõe sanções proporcionais.", "en": "Governance imposes proportionate sanctions." }
              ],
    "grammar":  "Not only… but also…; Formal conditionals (Should…); Passive voice; Regulatory register",
    "verbs":  "impose, expand, audit, report, prevent, comply, codify, schedule"
}
