{
  "title": "Carbon Frameworks",
  "title_pt": "Estruturas de Carbono",
  "text": "Complying with international carbon sequestration frameworks is paramount for accessing the European market. Not only have verification protocols been strengthened, but penalties for non‑compliance have also intensified; therefore, mitigation strategies must be codified. Should thresholds be tightened, we would recalibrate monitoring to preclude infractions. In practice, MRV procedures are audited under ISO 14064 and aligned with ETS benchmarks, whereby data integrity is safeguarded through independent accreditation. Rarely do projects pass scrutiny without transparent baselines, leakage assessments, and permanence guarantees; hence, contractual clauses stipulate remedial actions. Should cross‑border transfers be contested, arbitration would be invoked pursuant to the applicable lex mercatoria.",
  "translation": "Cumprir estruturas internacionais de sequestro de carbono é primordial para acessar o mercado europeu. Não apenas os protocolos de verificação foram reforçados, como também as penalidades por não conformidade se intensificaram; portanto, estratégias de mitigação devem ser codificadas. Caso os limites sejam apertados, recalibraríamos o monitoramento para evitar infrações. Na prática, procedimentos de MRV são auditados sob a ISO 14064 e alinhados a benchmarks do ETS, pelos quais a integridade dos dados é resguardada por acreditação independente. Raramente projetos passam pelo escrutínio sem linhas de base transparentes, avaliação de vazamentos e garantias de permanência; portanto, cláusulas contratuais estipulam medidas corretivas. Caso transferências transfronteiriças sejam contestadas, a arbitragem seria acionada conforme a lex mercatoria aplicável.",
  "pairs": [
    { "pt": "Estruturas de carbono são primordiais para acesso ao mercado.", "en": "Carbon frameworks are paramount for market access." },
    { "pt": "Não apenas protocolos foram reforçados, mas penalidades intensificadas.", "en": "Not only have protocols been strengthened, but penalties intensified." },
    { "pt": "Caso os limites apertem, recalibraremos o monitoramento.", "en": "Should thresholds be tightened, we would recalibrate monitoring." },
    { "pt": "Procedimentos de MRV são auditados sob ISO 14064.", "en": "MRV procedures are audited under ISO 14064." },
    { "pt": "Alinhamos métricas aos benchmarks do ETS.", "en": "Metrics are aligned with ETS benchmarks." },
    { "pt": "Raramente projetos passam sem linhas de base transparentes.", "en": "Rarely do projects pass without transparent baselines." },
    { "pt": "A avaliação de vazamentos e permanência é mandatória.", "en": "Leakage and permanence assessments are mandatory." },
    { "pt": "Cláusulas contratuais estipulam medidas corretivas.", "en": "Contractual clauses stipulate remedial actions." },
    { "pt": "Caso transferências transfronteiriças sejam contestadas, acionamos arbitragem.", "en": "Should cross‑border transfers be contested, arbitration would be invoked." },
    { "pt": "A integridade dos dados é resguardada por acreditação independente.", "en": "Data integrity is safeguarded through independent accreditation." }
  ],
  "grammar": "Inversions; Not only… but also…; Formal conditionals (Should…); Passive voice; Academic connectors",
  "verbs": "comply, codify, recalibrate, audit, preclude, strengthen, safeguard, invoke"
}
