{
  "title": "Patent Litigation",
  "title_pt": "Litígio de Patentes",
  "text": "Intellectual property litigation concerning Genetically Modified Organisms has become increasingly complex. Rarely do courts render uniform judgments across jurisdictions; however, the aforementioned precedents inform licensing strategy. Should injunctions be granted, operations would be constrained pending adjudication. Not only do claim constructions diverge, but damages calculations also vary substantially across fora; therefore, risk models incorporate sensitivity analyses. Cross‑border licensing must comply with TRIPS and national biosafety statutes, under which enforcement is coordinated. Should venue be challenged, proceedings would be stayed pending determination of the motion.",
  "translation": "O litígio de propriedade intelectual relativo a Organismos Geneticamente Modificados tornou‑se cada vez mais complexo. Raramente tribunais proferem decisões uniformes entre jurisdições; entretanto, os precedentes supracitados orientam a estratégia de licenciamento. Caso liminares sejam concedidas, as operações ficariam restritas até a adjudicação. Não apenas as interpretações de reivindicação divergem, como também os cálculos de danos variam substancialmente entre foros; portanto, modelos de risco incorporam análises de sensibilidade. O licenciamento transfronteiriço deve cumprir o TRIPS e estatutos nacionais de biossegurança, sob os quais a execução é coordenada. Caso a competência seja contestada, o processo seria suspenso até decisão da petição.",
  "pairs": [
    { "pt": "Raramente tribunais proferem decisões uniformes.", "en": "Rarely do courts render uniform judgments." },
    { "pt": "Precedentes supracitados orientam a estratégia de licenciamento.", "en": "Aforementioned precedents inform licensing strategy." },
    { "pt": "Caso liminares sejam concedidas, operações serão restringidas.", "en": "Should injunctions be granted, operations would be constrained." },
    { "pt": "Não apenas construções de reivindicação divergem; danos variam.", "en": "Not only do claim constructions diverge, but damages vary." },
    { "pt": "Modelos de risco incluem análises de sensibilidade.", "en": "Risk models include sensitivity analyses." },
    { "pt": "Licenciamento transfronteiriço cumpre TRIPS e biossegurança.", "en": "Cross‑border licensing complies with TRIPS and biosafety." },
    { "pt": "A execução é coordenada entre jurisdições.", "en": "Enforcement is coordinated across jurisdictions." },
    { "pt": "Caso a competência seja contestada, o processo será suspenso.", "en": "Should venue be challenged, proceedings would be stayed." },
    { "pt": "Descoberta é limitada por ordens de proteção.", "en": "Discovery is constrained by protective orders." },
    { "pt": "A indenização segue parâmetros jurisprudenciais.", "en": "Damages follow jurisprudential parameters." }
  ],
  "grammar": "Inversions; Not only… but also…; Formal conditionals (Should…); Passive voice; Legal register",
  "verbs": "adjudicate, constrain, render, inform, diverge, comply, coordinate, stay"
}
