{
    "title":  "Blockchain Traceability",
    "title_pt":  "Rastreabilidade Blockchain",
    "text":  "Implementing blockchain guarantees the immutability of traceability data throughout the entire supply chain. Not only has provenance been secured, but dispute resolution has also been streamlined; therefore, compliance reporting is expedited. Should governance nodes fail, contingency protocols would be triggered to preserve integrity. Smart contracts codify handovers and non‑repudiation, while role‑based access minimizes unauthorized edits. Rarely do off‑chain reconciliations suffice without robust oracle design; hence, integrity checks and key‑rotation policies are instituted.",
    "translation":  "A implementação de blockchain garante a imutabilidade dos dados de rastreabilidade por toda a cadeia de suprimentos. Não apenas a procedência foi assegurada, como também a resolução de disputas foi simplificada; portanto, os relatórios de conformidade são acelerados. Caso nós de governança falhem, protocolos de contingência seriam acionados para preservar a integridade. Contratos inteligentes codificam transferências e não repúdio, enquanto controle de acesso por papéis minimiza edições não autorizadas. Raramente reconciliações off‑chain são suficientes sem oráculos robustos; por isso, verificações de integridade e políticas de rotação de chaves são instituídas.",
    "pairs":  [
                  { "pt": "Blockchain garante imutabilidade dos dados.", "en": "Blockchain guarantees data immutability." },
                  { "pt": "Não apenas a procedência foi assegurada; disputas simplificadas.", "en": "Not only has provenance been secured, but disputes streamlined." },
                  { "pt": "Caso nós falhem, acionaremos contingência.", "en": "Should nodes fail, contingency would be triggered." },
                  { "pt": "Contratos inteligentes codificam transferências e não repúdio.", "en": "Smart contracts codify handovers and non‑repudiation." },
                  { "pt": "Acesso por papéis minimiza edições não autorizadas.", "en": "Role‑based access minimizes unauthorized edits." },
                  { "pt": "Raramente reconciliações off‑chain bastam sem oráculos.", "en": "Rarely do off‑chain reconciliations suffice without oracles." },
                  { "pt": "Verificações de integridade são instituídas.", "en": "Integrity checks are instituted." },
                  { "pt": "Políticas de rotação de chaves preservam segurança.", "en": "Key‑rotation policies preserve security." },
                  { "pt": "Relatórios são acelerados sob conformidade.", "en": "Reporting is expedited under compliance." },
                  { "pt": "Governança de consórcio mantém consistência.", "en": "Consortium governance maintains consistency." }
              ],
    "grammar":  "Not only… but also…; Formal conditionals (Should…); Passive voice; Systems vocabulary",
    "verbs":  "guarantee, secure, streamline, trigger, preserve, expedite, codify, institute"
}
