{
  "title": "Export Strategy and FX Hedge",
  "title_pt": "Estratégia de exportação e hedge cambial",
  "text": "A cooperative signs a forward export contract for 1,000 tons of soy meal at $480/t. The payment settles in USD; the current FX rate is R$5.10 per USD. Logistics include ocean freight at $22/t, port handling at $8/t, and insurance at 0.6% of cargo value for three months. There is a 2% export tax on gross sales. The cooperative hedges 70% of USD exposure via futures, locking FX at R$5.05/USD on that portion. With projected yield of 3.4 t/ha over 320 hectares (≈1,088 tons), the contract covers most output, leaving 88 tons for domestic sales.",
  "translation": "Uma cooperativa firma um contrato futuro de exportação de 1.000 toneladas de farelo de soja a $480/t. O pagamento liquida em USD; a taxa de câmbio atual é R$5,10 por USD. A logística inclui frete marítimo a $22/t, operações portuárias a $8/t e seguro a 0,6% do valor da carga por três meses. Há imposto de exportação de 2% sobre as vendas brutas. A cooperativa faz hedge de 70% da exposição em USD via futuros, travando o câmbio em R$5,05/USD nessa parcela. Com produtividade projetada de 3,4 t/ha em 320 hectares (≈1.088 toneladas), o contrato cobre a maior parte da produção, deixando 88 toneladas para vendas domésticas.",
  "vocabulary": [
    { "word": "Forward contract", "meaning": "contrato futuro" },
    { "word": "FX rate", "meaning": "taxa de câmbio" },
    { "word": "Ocean freight", "meaning": "frete marítimo" },
    { "word": "Port handling", "meaning": "operações portuárias" },
    { "word": "Insurance", "meaning": "seguro" },
    { "word": "Export tax", "meaning": "imposto de exportação" },
    { "word": "Hedge", "meaning": "proteção cambial" },
    { "word": "Exposure", "meaning": "exposição" },
    { "word": "Margin", "meaning": "margem" },
    { "word": "Revenue", "meaning": "receita" },
    { "word": "Ton", "meaning": "tonelada" },
    { "word": "Per hectare", "meaning": "por hectare" }
  ],
  "grammar": "Advanced financial/operational reporting; Passive Voice; Hedge mechanics",
  "verbs": "sign, settle, include, hedge, lock, cover, leave"
}
