{
    "title":  "Trade Compliance",
    "title_pt":  "Conformidade Comercial",
    "text":  "Exporting to the EU requires strict adherence to animal welfare legislation, notwithstanding higher production costs. Rarely do exemptions apply to intensive systems; therefore, compliance auditing has been intensified. Should directives be updated, we would promptly harmonize protocols to avoid sanctions. Transport time limits and stunning requirements are enforced uniformly, and lairage conditions are audited. Not only are documentation and labeling scrutinized, but supply‑chain attestations are also verified to preclude detentions.",
    "translation":  "Exportar para a UE exige estrita observância da legislação de bem‑estar animal, a despeito de maiores custos de produção. Raramente isenções se aplicam a sistemas intensivos; portanto, a auditoria de conformidade foi intensificada. Caso as diretivas sejam atualizadas, harmonizaríamos prontamente os protocolos para evitar sanções. Limites de tempo de transporte e requisitos de insensibilização são aplicados de forma uniforme, e as condições de repouso são auditadas. Não apenas documentação e rotulagem são escrutinadas, como também atestações da cadeia de suprimentos são verificadas para evitar detenções.",
    "pairs":  [
                  { "pt": "Exportar para a UE exige observância estrita ao bem‑estar animal.", "en": "Exporting to the EU requires strict adherence to animal welfare." },
                  { "pt": "Raramente isenções se aplicam a sistemas intensivos.", "en": "Rarely do exemptions apply to intensive systems." },
                  { "pt": "Caso diretivas mudem, harmonizaremos protocolos para evitar sanções.", "en": "Should directives be updated, we would harmonize protocols to avoid sanctions." },
                  { "pt": "Limites de transporte e insensibilização são aplicados.", "en": "Transport limits and stunning are enforced." },
                  { "pt": "Condições de repouso são auditadas em plantas.", "en": "Lairage conditions are audited across plants." },
                  { "pt": "Não apenas rotulagem, mas atestações são verificadas.", "en": "Not only labeling, but attestations are verified." },
                  { "pt": "Harmonização evita sanções e atrasos.", "en": "Harmonization prevents sanctions and delays." },
                  { "pt": "Conformidade é supervisionada por auditorias independentes.", "en": "Compliance is overseen by independent audits." },
                  { "pt": "Caso documentação falhe, cargas podem ser detidas.", "en": "Should documentation lapse, consignments may be detained." },
                  { "pt": "Relatórios de conformidade são atualizados periodicamente.", "en": "Compliance reports are updated periodically." }
              ],
    "grammar":  "Inversions; Concession (notwithstanding); Formal conditionals (Should…); Passive voice; Legal‑economic register",
    "verbs":  "adhere, harmonize, audit, update, avoid, impose, enforce, verify"
}
