{
    "title":  "Zoonotic Mitigation",
    "title_pt":  "Mitigação Zoonótica",
    "text":  "Mitigating the risk of zoonotic spillover requires a holistic 'One Health' approach involving veterinarians and ecologists. Rarely do siloed interventions yield durable outcomes; therefore, cross‑sector governance is mandated. Should surveillance thresholds be exceeded, emergency protocols would be activated under the compliance framework. Not only are case definitions standardized, but reporting cadence is also enforced across districts; consequently, data interoperability is improved. Syndromic surveillance and sentinel herds are integrated to preempt spillover routes.",
    "translation":  "Mitigar o risco de transbordamento zoonótico requer uma abordagem holística de 'One Health' envolvendo veterinários e ecologistas. Raramente intervenções isoladas geram resultados duráveis; portanto, a governança intersetorial é mandatória. Caso limiares de vigilância sejam excedidos, protocolos de emergência seriam ativados sob a estrutura de conformidade. Não apenas definições de caso são padronizadas, como também a cadência de reporte é aplicada entre distritos; consequentemente, a interoperabilidade de dados é aprimorada. Vigilância sindrômica e rebanhos sentinela são integrados para prevenir rotas de transbordamento.",
    "pairs":  [
                  { "pt": "Mitigar risco zoonótico requer 'One Health'.", "en": "Mitigating zoonotic risk requires 'One Health'." },
                  { "pt": "Raramente intervenções isoladas geram resultados duráveis.", "en": "Rarely do siloed interventions yield durable outcomes." },
                  { "pt": "Caso limiares sejam excedidos, ativaremos protocolos.", "en": "Should thresholds be exceeded, protocols would be activated." },
                  { "pt": "Definições de caso são padronizadas.", "en": "Case definitions are standardized." },
                  { "pt": "A cadência de reporte é aplicada entre distritos.", "en": "Reporting cadence is enforced across districts." },
                  { "pt": "Interoperabilidade de dados é aprimorada.", "en": "Data interoperability is improved." },
                  { "pt": "Vigilância sindrômica é integrada ao monitoramento.", "en": "Syndromic surveillance is integrated into monitoring." },
                  { "pt": "Rebanhos sentinela preveem rotas de transbordamento.", "en": "Sentinel herds preempt spillover routes." },
                  { "pt": "Governança intersetorial é mandatória.", "en": "Cross‑sector governance is mandated." },
                  { "pt": "Conformidade guia protocolos de emergência.", "en": "Compliance guides emergency protocols." }
              ],
    "grammar":  "Inversions; Formal conditionals (Should…); Passive voice; Scientific‑policy register",
    "verbs":  "mitigate, mandate, activate, surveil, yield, govern, standardize, enforce, integrate"
}
