{
    "title":  "Genomic Editing",
    "title_pt":  "Edição Genômica",
    "text":  "CRISPR‑Cas9 technology offers unprecedented precision in disease resistance, albeit with significant regulatory hurdles. Rarely do ethical boards authorize deployments without exhaustive review; therefore, governance committees have instituted tiered compliance. Should the regulations change, we would be compelled to re‑submit dossiers under the updated framework. Not only are off‑target analyses required, but longitudinal monitoring is also mandated to track phenotypic stability and ecological impact. Dossier pre‑screening, public comment periods, and data repository requirements structure oversight.",
    "translation":  "A tecnologia CRISPR‑Cas9 oferece precisão sem precedentes em resistência a doenças, embora com obstáculos regulatórios significativos. Raramente conselhos de ética autorizam implementações sem revisão exaustiva; portanto, comitês de governança instituíram conformidade em níveis. Caso os regulamentos mudem, seríamos compelidos a reapresentar dossiês sob a estrutura atualizada. Não apenas análises de off‑target são exigidas, como também monitoramento longitudinal é mandatário para acompanhar estabilidade fenotípica e impacto ecológico. Pré‑triagem de dossiês, períodos de consulta pública e requisitos de repositórios de dados estruturam a supervisão.",
    "pairs":  [
                  { "pt": "CRISPR‑Cas9 oferece precisão sem precedentes.", "en": "CRISPR‑Cas9 offers unprecedented precision." },
                  { "pt": "Raramente conselhos autorizam sem revisão exaustiva.", "en": "Rarely do boards authorize without exhaustive review." },
                  { "pt": "Caso regulamentos mudem, dossiês serão reapresentados.", "en": "Should regulations change, dossiers would be re‑submitted." },
                  { "pt": "Análises de off‑target são exigidas.", "en": "Off‑target analyses are required." },
                  { "pt": "Monitoramento longitudinal é mandatário.", "en": "Longitudinal monitoring is mandated." },
                  { "pt": "Consulta pública estrutura a supervisão.", "en": "Public comment structures oversight." },
                  { "pt": "Pré‑triagem de dossiês organiza o fluxo.", "en": "Dossier pre‑screening organizes the flow." },
                  { "pt": "Repositórios de dados são requeridos.", "en": "Data repositories are required." },
                  { "pt": "Governança institui conformidade em níveis.", "en": "Governance institutes tiered compliance." },
                  { "pt": "Impacto ecológico é monitorado ao longo do tempo.", "en": "Ecological impact is monitored over time." }
              ],
    "grammar":  "Concession (albeit); Inversions; Formal conditionals (Should…); Passive voice; Regulatory‑ethical register",
    "verbs":  "authorize, submit, govern, review, change, offer, monitor, require"
}
