[
  { "en": "We have analyzed yield variability; Therefore, ROI has improved. However, some zones have remained inefficient.", "pt": "Nós temos analisado a variabilidade de rendimento; Portanto, o ROI tem melhorado. No entanto, algumas zonas têm permanecido ineficientes." },
  { "en": "We have calibrated sprayer rates; Therefore, applications have been more efficient. However, wind drift has affected borders.", "pt": "Nós temos calibrado as taxas do pulverizador; Portanto, as aplicações têm sido mais eficientes. No entanto, a deriva do vento tem afetado as bordas." },
  { "en": "We have invested in variable‑rate seeders; Therefore, efficiency has improved. However, maintenance costs have risen slightly.", "pt": "Nós temos investido em semeadoras de taxa variável; Portanto, a eficiência tem melhorado. No entanto, os custos de manutenção têm aumentado ligeiramente." },
  { "en": "We have implemented soil moisture sensors; Therefore, water use has dropped. However, sensor failures have occurred during storms.", "pt": "Nós temos implementado sensores de umidade do solo; Portanto, o uso de água tem caído. No entanto, falhas de sensores têm ocorrido durante tempestades." },
  { "en": "We have selected sires with superior feed conversion; Therefore, average daily gain has increased. However, variability has persisted in heat stress.", "pt": "Nós temos selecionado reprodutores com conversão alimentar superior; Portanto, o ganho médio diário tem aumentado. No entanto, a variabilidade tem persistido sob estresse térmico." },
  { "en": "We have adopted rotational grazing; Therefore, forage recovery has improved. However, overstocked paddocks have reduced gains.", "pt": "Nós temos adotado pastejo rotativo; Portanto, a recuperação da forragem tem melhorado. No entanto, piquetes superlotados têm reduzido os ganhos." },
  { "en": "We have tracked cost per head; Therefore, profit per animal has risen. However, market volatility has compressed margins.", "pt": "Nós temos acompanhado o custo por cabeça; Portanto, o lucro por animal tem aumentado. No entanto, a volatilidade do mercado tem comprimido as margens." },
  { "en": "We have standardized hormonal protocols; Therefore, conception rates have improved. However, compliance gaps have affected late‑cycling cows.", "pt": "Nós temos padronizado protocolos hormonais; Portanto, as taxas de concepção têm melhorado. No entanto, lacunas de conformidade têm afetado vacas em ciclo tardio." },
  { "en": "We have monitored anthelmintic efficacy; Therefore, rotation has been adjusted. However, resistance has emerged in multi‑grazed pastures.", "pt": "Nós temos monitorado a eficácia de anti‑helmínticos; Portanto, a rotação tem sido ajustada. No entanto, resistência tem surgido em pastagens com múltiplos rebanhos." },
  { "en": "We have implemented advanced biosecurity; Therefore, pathogen ingress has been minimized. However, staff turnover has reduced adherence.", "pt": "Nós temos implementado biossegurança avançada; Portanto, a entrada de patógenos tem sido minimizada. No entanto, a rotatividade de pessoal tem reduzido a adesão." }
]
