[
  { "id": 1, "level": "C1", "category": "Máquinas/Campo", "title": "Yield Analysis", "title_pt": "Análise de Rendimento", "text_en": "We have analyzed the yield data from the last harvest. The results indicate a 10% increase in efficiency due to the new machinery. However, variability has persisted in sandy plots; therefore, input strategy will be refined.", "text_pt": "Nós temos analisado os dados de rendimento da última colheita. Os resultados indicam um aumento de 10% na eficiência devido às novas máquinas. Entretanto, a variabilidade tem persistido em áreas arenosas; portanto, a estratégia de insumos será refinada." },
  { "id": 2, "level": "C1", "category": "Máquinas/Campo", "title": "ROI Calculation", "title_pt": "Cálculo de ROI", "text_en": "The Return on Investment (ROI) for the new tractors is positive; therefore, we will approve the purchase of two more units. The proposal has been reviewed, and the payback period has been reduced.", "text_pt": "O Retorno sobre Investimento (ROI) dos novos tratores é positivo; portanto, aprovaremos a compra de mais duas unidades. A proposta foi revisada, e o prazo de retorno foi reduzido." },
  { "id": 3, "level": "C1", "category": "Máquinas/Campo", "title": "Precision Strategy", "title_pt": "Estratégia de Precisão", "text_en": "Variable rate application has been implemented. However, we still need to calibrate the sensors for better accuracy; therefore, a field audit has been scheduled.", "text_pt": "A aplicação em taxa variável foi implementada. Entretanto, ainda precisamos calibrar os sensores para melhor precisão; portanto, uma auditoria de campo foi agendada." },
  { "id": 4, "level": "C1", "category": "Máquinas/Campo", "title": "Predictive Maintenance", "title_pt": "Manutenção Preditiva", "text_en": "The software predicts engine failures before they happen. Furthermore, maintenance is scheduled automatically to avoid downtime; therefore, the service plan has been optimized.", "text_pt": "O software prevê falhas de motor antes que ocorram. Além disso, a manutenção é agendada automaticamente para evitar paradas; portanto, o plano de serviço foi otimizado." },
  { "id": 5, "level": "C1", "category": "Pecuária", "title": "Genetic Improvement", "title_pt": "Melhoramento Genético", "text_en": "We have selected bulls with superior genetics to improve the herd's feed conversion ratio. The selection criteria have been validated by performance data.", "text_pt": "Nós temos selecionado touros com genética superior para melhorar a taxa de conversão alimentar do rebanho. Os critérios de seleção foram validados por dados de desempenho." },
  { "id": 6, "level": "C1", "category": "Pecuária", "title": "Profitability", "title_pt": "Lucratividade", "text_en": "The profit margin per animal has stabilized. We are analyzing the cost of feed to optimize the budget; however, contracts have been renegotiated to mitigate volatility.", "text_pt": "A margem de lucro por animal tem se estabilizado. Estamos analisando o custo da ração para otimizar o orçamento; entretanto, contratos foram renegociados para mitigar a volatilidade." },
  { "id": 7, "level": "C1", "category": "Pecuária", "title": "Pasture Management", "title_pt": "Gestão de Pasto", "text_en": "Intensive rotational grazing has improved soil health; therefore, forage quality is significantly higher this year. Furthermore, stocking density has been optimized across paddocks.", "text_pt": "O pastejo rotativo intensivo tem melhorado a saúde do solo; portanto, a qualidade da forragem está significativamente maior neste ano. Além disso, a densidade de lotação tem sido otimizada entre os piquetes." },
  { "id": 8, "level": "C1", "category": "Veterinária", "title": "Biosecurity Protocols", "title_pt": "Protocolos de Biossegurança", "text_en": "Strict biosecurity protocols have been established to prevent pathogen entry. Access is controlled by software; furthermore, training programs have been updated to maintain adherence.", "text_pt": "Protocolos rigorosos de biossegurança têm sido estabelecidos para prevenir a entrada de patógenos. O acesso é controlado por software; além disso, programas de treinamento têm sido atualizados para manter a adesão." },
  { "id": 9, "level": "C1", "category": "Veterinária", "title": "Resistance Analysis", "title_pt": "Análise de Resistência", "text_en": "We have observed parasite resistance in specific cohorts. Therefore, active ingredients in the medication are being changed, and the rotation policy has been revised.", "text_pt": "Nós temos observado resistência a parasitas em grupos específicos. Portanto, os princípios ativos do medicamento estão sendo alterados, e a política de rotação foi revisada." },
  { "id": 10, "level": "C1", "category": "Veterinária", "title": "Compliance Audit", "title_pt": "Auditoria de Conformidade", "text_en": "The farm has passed the international sanitary audit, demonstrating our commitment to quality and safety standards. However, minor findings have been addressed with corrective actions; therefore, certification has been confirmed.", "text_pt": "A fazenda passou na auditoria sanitária internacional, demonstrando nosso compromisso com padrões de qualidade e segurança. Entretanto, constatações menores foram tratadas com ações corretivas; portanto, a certificação foi confirmada." }
]
