[
  { "id": 1, "level": "B2", "category": "Agro", "title": "Yield and ROI Review", "title_pt": "Revisão de rendimento e ROI", "text_en": "We have reviewed yield maps and prioritized plots with higher ROI. Therefore, resource allocation has improved; however, some sandy zones have remained inefficient.", "text_pt": "Nós temos revisado mapas de rendimento e priorizado talhões com maior ROI. Portanto, a alocação de recursos tem melhorado; no entanto, algumas zonas arenosas têm permanecido ineficientes." },
  { "id": 2, "level": "B2", "category": "Agro", "title": "Sprayer Calibration Report", "title_pt": "Relatório de calibração do pulverizador", "text_en": "We have calibrated application rates using field trials. Therefore, coverage has improved; however, wind drift has affected border rows.", "text_pt": "Nós temos calibrado taxas de aplicação com testes de campo. Portanto, a cobertura tem melhorado; no entanto, a deriva do vento tem afetado linhas de borda." },
  { "id": 3, "level": "B2", "category": "Agro", "title": "Machinery Investment Summary", "title_pt": "Resumo de investimento em máquinas", "text_en": "We have invested in guidance and variable‑rate seeders. Therefore, setup time has decreased; however, maintenance costs have risen slightly.", "text_pt": "Nós temos investido em guiamento e semeadoras de taxa variável. Portanto, o tempo de preparação tem diminuído; no entanto, os custos de manutenção têm aumentado ligeiramente." },
  { "id": 4, "level": "B2", "category": "Agro", "title": "Data‑Driven Irrigation Plan", "title_pt": "Plano de irrigação orientado por dados", "text_en": "We have implemented soil moisture sensors and alerts. Therefore, water use has dropped; however, sensor failures have occurred during storms.", "text_pt": "Nós temos implementado sensores de umidade do solo e alertas. Portanto, o uso de água tem caído; no entanto, falhas de sensores têm ocorrido durante tempestades." },
  { "id": 5, "level": "B2", "category": "Pecuária", "title": "Genetics and Conversion", "title_pt": "Genética e conversão", "text_en": "We have selected sires with better feed conversion. Therefore, average daily gain has increased; however, variability has persisted in heat stress.", "text_pt": "Nós temos selecionado reprodutores com melhor conversão alimentar. Portanto, o ganho médio diário tem aumentado; no entanto, a variabilidade tem persistido sob estresse térmico." },
  { "id": 6, "level": "B2", "category": "Pecuária", "title": "Pasture Management KPIs", "title_pt": "KPIs de gestão de pastagem", "text_en": "We have adopted rotational grazing and monitored sward height. Therefore, forage recovery has improved; however, overstocked paddocks have reduced gains.", "text_pt": "Nós temos adotado pastejo rotativo e monitorado a altura do pasto. Portanto, a recuperação da forragem tem melhorado; no entanto, piquetes superlotados têm reduzido os ganhos." },
  { "id": 7, "level": "B2", "category": "Pecuária", "title": "Profit per Animal Dashboard", "title_pt": "Painel de lucro por animal", "text_en": "We have tracked cost per head and revenue by cohort. Therefore, profit per animal has risen; however, market volatility has compressed margins.", "text_pt": "Nós temos acompanhado o custo por cabeça e a receita por lote. Portanto, o lucro por animal tem aumentado; no entanto, a volatilidade do mercado tem comprimido as margens." },
  { "id": 8, "level": "B2", "category": "Vet", "title": "Hormonal Protocol Compliance", "title_pt": "Conformidade de protocolos hormonais", "text_en": "We have standardized synchronization protocols. Therefore, conception rates have improved; however, compliance gaps have affected late‑cycling cows.", "text_pt": "Nós temos padronizado protocolos de sincronização. Portanto, as taxas de concepção têm melhorado; no entanto, lacunas de conformidade têm afetado vacas em ciclo tardio." },
  { "id": 9, "level": "B2", "category": "Vet", "title": "Parasite Resistance Trends", "title_pt": "Tendências de resistência a parasitas", "text_en": "We have monitored anthelmintic efficacy and adjusted rotation. Therefore, control has improved; however, resistance has emerged in multi‑grazed pastures.", "text_pt": "Nós temos monitorado a eficácia de anti‑helmínticos e ajustado a rotação. Portanto, o controle tem melhorado; no entanto, resistência tem surgido em pastagens com múltiplos rebanhos." },
  { "id": 10, "level": "B2", "category": "Vet", "title": "Advanced Biosecurity Measures", "title_pt": "Medidas de biossegurança avançada", "text_en": "We have implemented advanced checkpoints and audits. Therefore, pathogen ingress has been minimized; however, staff turnover has reduced adherence.", "text_pt": "Nós temos implementado pontos de controle e auditorias avançadas. Portanto, a entrada de patógenos tem sido minimizada; no entanto, a rotatividade de pessoal tem reduzido a adesão." }
  ,{ "id": 11, "level": "B2", "category": "Agro", "title": "Negotiation and Application Plan", "title_pt": "Negociação e plano de aplicação", "text_en": "Diego negotiates fertilizer and fuel, and plans irrigation materials. He buys 300 kg of NPK at $0.80/kg and applies 150 kg/ha over 2 hectares. He budgets 120 liters of diesel at $1.20/L. He installs 200 meters of pipe at $2.50/m. Expected yield is 6 t/ha across 3 hectares (18 tons), and if price reaches $220/t, revenue is $3,960.", "text_pt": "Diego negocia fertilizante e combustível, e planeja materiais de irrigação. Ele compra 300 kg de NPK a $0,80/kg e aplica 150 kg/ha em 2 hectares. Ele orça 120 litros de diesel a $1,20/L. Ele instala 200 metros de tubulação a $2,50/m. A produtividade esperada é de 6 t/ha em 3 hectares (18 toneladas), e se o preço atingir $220/t, a receita será $3.960." }
  ,{ "id": 12, "level": "B2", "category": "Agro/Logística", "title": "Scheduled Times and Addresses", "title_pt": "Horários e endereços programados", "text_en": "Deliveries are scheduled at 07:00 at 125 Green Road. The morning meeting is held at 09:30 at 18 Oak Street. Addresses are confirmed by radio, and gates are opened at 06:45. The schedule is updated at 17:00.", "text_pt": "As entregas são programadas às 07:00 na Rua Green, 125. A reunião da manhã é realizada às 09:30 na Rua Oak, 18. Os endereços são confirmados por rádio e os portões são abertos às 06:45. A programação é atualizada às 17:00." }
]
